// פונקציה לחיפוש פשוט באמצעות includes
function simpleSearch(query, text) {
  return text.includes(query); // בודק אם הטקסט מכיל את מחרוזת החיפוש
}

// פונקציה להסתיר ולהציג כרטיסים בהתאם לחיפוש
function hideShowCards() {
  const query = document.getElementById("searchInput").value.trim().toLowerCase(); // קבלת הטקסט מהשדה והפיכתו לאותיות קטנות

  // לולאה שעוברת על כל הכרטיסים לפי מזהה
  for (let i = 0; i < 10; i++) {
    const card = document.getElementById(`product${i}`); // מקבלת את הכרטיס לפי מזהה ID
    const cardTitle = card.querySelector(".card-title").textContent.toLowerCase(); // מקבלת את הכותרת של הכרטיס
    const cardDescription = card.querySelector(".card-text").textContent.toLowerCase(); // מקבלת את התיאור של הכרטיס

    // בדיקה אם הכרטיס תואם את החיפוש בכותרת או בתיאור
    if (simpleSearch(query, cardTitle) || simpleSearch(query, cardDescription)) {
      card.style.display = ""; // הצגת הכרטיס אם הוא תואם
    } else {
      card.style.display = "none"; // הסתרת הכרטיס אם הוא לא תואם
    }
  }
}

// הוספת מאזין לחצן לחיפוש - הפעלת פונקציית hideShowCards בעת לחיצה על כפתור החיפוש
document.getElementById("searchButton").addEventListener("click", hideShowCards);

// מצמידים לכפתור הורדת PDF
document.getElementById("downloadPdfButton").addEventListener("click", downloadPDF);

// מצמידים לכפתור סגירת כרטיס מידע
document.getElementById("infoCardClose").addEventListener("click", closeInfoCard);

// פונקציה להצגת כרטיס מידע
function closeInfoCard() {
  const infoCard = document.getElementById("info");
  infoCard.style.display = "none";
}

function showInfoCard(index) {
  const infoCard = document.getElementById("info");
  const infoParagraph = document.getElementById("infoP");
  infoParagraph.innerHTML = info[index];
  infoCard.style.display = "block";
}

function changeFontColor() {
  const cards = document.getElementsByClassName("card");
  for (let card of cards) {
    card.style.color = card.style.color === "black" ? "#be8c6b" : "black";
  }
}
// פונקציה שמורידה את הקובץ ששמור בלינק ב HTML
function downloadPDF() {
  const pdfLink = document.getElementById("hiddenPdfLink");
  pdfLink.target = "_blank"; // פותח בטאב חדש במקום לדרוס
  pdfLink.click();
}

const info = [
  " צ'רי פלאואר (Cherry Plum) <br><br>סגולות רפואיות: מתאימה לאנשים שחווים לחץ נפשי עז, פחד מאובדן שליטה, מחשבות אובדניות ונטייה להתפרצויות זעם בלתי נשלטות. התמצית מסייעת בשיקום תחושת השליטה העצמית ומעניקה רוגע ושלווה פנימיים.<br><br> דרכי נטילה: טיפות ישירות לפה- מספר טיפות מספר פעמים ביום. הוספה למים- מספר טיפות לכוס מים ולשתות לאורך היום. <br><br>טוב במיוחד ל: נדודי שינה הנגרמים מחרדה ומתח, קשיים ביחסים הבין-אישיים עקב התפרצויות זעם או מצבי חירום נפשיים זמניים.",

  "אימפיישנס (Impatiens)<br><br> סגולות רפואיות: מתאימה לאנשים חסרי סבלנות שנוטים להתעצבן בקלות. התמצית מסייעת לפתח סבלנות, רוגע פנימי ויכולת להמתין. <br><br>דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום, בהתאם להנחיות המטפל.<br><br> הוספה למים:  ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום.<br><br>טוב במיוחד ל: חוסר סבלנות",

  "רוק רוז (Rock Rose)<br><br>סגולות רפואיות:  רוק רוז היא תמצית חירום, המיועדת למצבי פאניקה, אימה ופחד קיצוני. היא מסייעת להרגיע את הנפש, להחזיר תחושת שליטה ולספק אומץ להתמודד עם מצבי חירום.<br><br> דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום, במיוחד במצבי חירום או לפני מצבים מעוררי חרדה. הוספה למים:  ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום, במיוחד במצבים של חרדה מתמשכת .<br><br>טוב במיוחד ל: פאניקה והתקפי חרדה, לאחר חוויות טראומטיות, סיוטים.",

  "אספן (Aspen)<br><br>סגולות רפואיות: אספן היא תמצית פרחי באך המיועדת להרגעת חרדות בלתי מוסברות ופחדים עמומים. היא מסייעת להפחית את תחושת החרדה המתמדת, ומעניקה תחושה של רוגע ושלווה פנימית. <br><br>דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום, במיוחד במצבים של חרדה גוברת או לפני מצבים מעוררי חרדה.<br>הוספה למים: ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום. <br><br>טוב במיוחד ל: חרדות, פחדים עמומים, תחושת חרדה מתמדת, קושי להירדם בגלל חרדה.",

  "קלמטיס (Clematis) <br><br>סגולות רפואיות:  קלמטיס היא תמצית פרחי באך המיועדת לאנשים שחיים בעולם החלומות ולא מספיק מעוגנים במציאות. היא מסייעת להחזיר את האדם להווה, להגביר את המודעות לסביבה ולעודד פעולה. קלמטיס מועילה לאנשים נוטים להיסח הדעת, חולמים, ובעלי נטייה לברוח למחוזות רחוקים.<br><br> דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום, במיוחד במצבים שבהם מרגישים ניתוק מהמציאות. הוספה למים: ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום, במיוחד במצבים של חוסר מוטיבציה או עייפות נפשית. <br><br>טוב במיוחד ל:חוסר מוטיבציה ועייפות נפשית, אנשים המרגישים ניתוק מהסביבה.",

  "מימולוס (Mimulus)<br><br>סגולות רפואיות: מימולוס היא תמצית פרחי באך המיועדת לאנשים החווים פחד מגורמים ידועים ומצבים ספציפיים. היא מסייעת להפחית את <br><br>רמת החרדה והפחד הקשורים למצבים אלו, ומעניקה אומץ להתמודד. <br><br>דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום, במיוחד לפני מצבים מעוררי חרדה או במהלכם. הוספה למים: ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום, במיוחד במצבים של חרדה מתמשכת הקשורה למצב ספציפי. <br><br>טוב במיוחד ל: פחד מגורמים ידועים.",

  "וייט צ'סטנט (White Chestnut)<br><br> סגולות רפואיות: וייט צ'סטנט היא תמצית פרחי באך המיועדת לאנשים הסובלים ממחשבות טורדניות וחוזרות על עצמן. היא מסייעת להרגיע את המוח, להפחית את עוצמת המחשבות הטורדניות ולהשיג שקט נפשי. <br><br>דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום, במיוחד לפני השינה או במצבים של מחשבות טורדניות. הוספה למים: ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום, במיוחד במצבים של חוסר שקט נפשי.<br><br> טוב במיוחד ל: מחשבות טורדניות וחוזרות על עצמן, חרדה ומתח.צמח זה יכול להפחית כאבים ולהקל על כאבי ראש",

  "אלם (Elm)<br><br> סגולות רפואיות: אלם היא תמצית פרחי באך המיועדת לאנשים החשים עייפות נפשית עמוקה ותשישות. היא מסייעת להחזיר את האנרגיה, להרגיע את הנפש ולספק תחושה שהתחדשות. אלם מועילה לאנשים שעברו חוויה מתישה.<br><Br> דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום, במיוחד במצבים של עייפות קיצונית או לאחר מאמץ נפשי. הוספה למים: ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום, במיוחד במצבים של תשישות מתמשכת. <br><br>טוב במיוחד ל: עייפות נפשית עמוקה, חוסר אנרגיה, הרגשה של ריקנות.",

  "כוכב בית לחם (Star of Bethlehem) <br><br>סגולות רפואיות: כוכב בית לחם היא תמצית פרחי באך המיועדת לאנשים שחוו טראומה או הלם נפשי. היא מסייעת להקל על ההלם והזעזוע, להפחית את הכאב הנפשי ומסייעת בתהליך ההתאוששות. <br><br>דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום, במיוחד מיד לאחר חוויה טראומטית או כאשר מרגישים זעזוע נפשי. הוספה למים: ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום, במיוחד בתקופת ההתאוששות. <br><br>טוב במיוחד ל: הלם נפשי לאחר חוויה טראומטית, כאב נפשי עמוק.",

  "וולנאט (Walnut) <br><br> סגולות רפואיות: וולנאט היא תמצית פרחי באך המיועדת לתקופות של שינוי גדול בחיים.<br><br> דרכי נטילה: טיפות ישירות לפה: מספר טיפות מספר פעמים ביום. הוספה למים: ניתן להוסיף מספר טיפות לכוס מים ולשתות לאורך היום, במיוחד בתקופות של חוסר ודאות.<br><br> טוב במיוחד ל:אנשים העוברים שינויים משמעותיים בחיים, אנשים החשים חוסר יציבות או חוסר ביטחון.",
];

window.onload = function () {
  window.scrollTo(0, 0);
};
